Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_mask.h
#ifndef _ISP_REG_MASK_H_INC_
#define _ISP_REG_MASK_H_INC_

#include <isp_reg.h>
#include <isp_reg_base.h>

#define MASK_GLOBLE_EN (MASK_REG_BASE + 0x0000)
#define MASK_PATTERN (MASK_REG_BASE + 0x0004)
#define MASK_RECTANGLE1_START (MASK_REG_BASE + 0x0010)
#define MASK_RECTANGLE1_END (MASK_REG_BASE + 0x0014)
#define MASK_RECTANGLE2_START (MASK_REG_BASE + 0x0018)
#define MASK_RECTANGLE2_END (MASK_REG_BASE + 0x001C)
#define MASK_RECTANGLE3_START (MASK_REG_BASE + 0x0020)
#define MASK_RECTANGLE3_END (MASK_REG_BASE + 0x0024)
#define MASK_RECTANGLE4_START (MASK_REG_BASE + 0x0028)
#define MASK_RECTANGLE4_END (MASK_REG_BASE + 0x002C)
#define MASK_GRID_START (MASK_REG_BASE + 0x0040)
#define MASK_GRID_WINUM (MASK_REG_BASE + 0x0044)
#define MASK_GRID_WIN_SIZE (MASK_REG_BASE + 0x0048)
#define MASK_BITMAP0 (MASK_REG_BASE + 0x0050)
#define MASK_BITMAP1 (MASK_REG_BASE + 0x0054)
#define MASK_BITMAP58 (MASK_REG_BASE + 0x0138)
#define MASK_BITMAP59 (MASK_REG_BASE + 0x013C)

/* MASK_GLOBLE_EN 0x0000 */
#define MASK_GLOBLE_EN_OFFSET 0
#define MASK_GLOBLE_EN_BITS 5
#define MASK_GLOBLE_EN_MASK (((1 << 5) - 1) << 0)
/* MASK_PATTERN 0x0004 */
#define MASK_Y_OFFSET 0
#define MASK_Y_BITS 8
#define MASK_Y_MASK (((1 << 8) - 1) << 0)
#define MASK_U_OFFSET 8
#define MASK_U_BITS 8
#define MASK_U_MASK (((1 << 8) - 1) << 8)
#define MASK_V_OFFSET 16
#define MASK_V_BITS 8
#define MASK_V_MASK (((1 << 8) - 1) << 16)
/* MASK_RECTANGLE1_START 0x0010 */
#define MASK1_START_X_OFFSET 0
#define MASK1_START_X_BITS 12
#define MASK1_START_X_MASK (((1 << 12) - 1) << 0)
#define MASK1_START_Y_OFFSET 16
#define MASK1_START_Y_BITS 12
#define MASK1_START_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE1_END 0x0014 */
#define MASK1_END_X_OFFSET 0
#define MASK1_END_X_BITS 12
#define MASK1_END_X_MASK (((1 << 12) - 1) << 0)
#define MASK1_END_Y_OFFSET 16
#define MASK1_END_Y_BITS 12
#define MASK1_END_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE2_START 0x0018 */
#define MASK2_START_X_OFFSET 0
#define MASK2_START_X_BITS 12
#define MASK2_START_X_MASK (((1 << 12) - 1) << 0)
#define MASK2_START_Y_OFFSET 16
#define MASK2_START_Y_BITS 12
#define MASK2_START_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE2_END 0x001C */
#define MASK2_END_X_OFFSET 0
#define MASK2_END_X_BITS 12
#define MASK2_END_X_MASK (((1 << 12) - 1) << 0)
#define MASK2_END_Y_OFFSET 16
#define MASK2_END_Y_BITS 12
#define MASK2_END_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE3_START 0x0020 */
#define MASK3_START_X_OFFSET 0
#define MASK3_START_X_BITS 12
#define MASK3_START_X_MASK (((1 << 12) - 1) << 0)
#define MASK3_START_Y_OFFSET 16
#define MASK3_START_Y_BITS 12
#define MASK3_START_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE3_END 0x0024 */
#define MASK3_END_X_OFFSET 0
#define MASK3_END_X_BITS 12
#define MASK3_END_X_MASK (((1 << 12) - 1) << 0)
#define MASK3_END_Y_OFFSET 16
#define MASK3_END_Y_BITS 12
#define MASK3_END_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE4_START 0x0028 */
#define MASK4_START_X_OFFSET 0
#define MASK4_START_X_BITS 12
#define MASK4_START_X_MASK (((1 << 12) - 1) << 0)
#define MASK4_START_Y_OFFSET 16
#define MASK4_START_Y_BITS 12
#define MASK4_START_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_RECTANGLE4_END 0x002C */
#define MASK4_END_X_OFFSET 0
#define MASK4_END_X_BITS 12
#define MASK4_END_X_MASK (((1 << 12) - 1) << 0)
#define MASK4_END_Y_OFFSET 16
#define MASK4_END_Y_BITS 12
#define MASK4_END_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_GRID_START 0x0040 */
#define MASK_START_X_OFFSET 0
#define MASK_START_X_BITS 12
#define MASK_START_X_MASK (((1 << 12) - 1) << 0)
#define MASK_START_Y_OFFSET 16
#define MASK_START_Y_BITS 12
#define MASK_START_Y_MASK (((1 << 12) - 1) << 16)
/* MASK_GRID_WINUM 0x0044 */
#define MASK_WINUM_X_OFFSET 0
#define MASK_WINUM_X_BITS 6
#define MASK_WINUM_X_MASK (((1 << 6) - 1) << 0)
#define MASK_WINUM_Y_OFFSET 8
#define MASK_WINUM_Y_BITS 5
#define MASK_WINUM_Y_MASK (((1 << 5) - 1) << 8)
/* MASK_GRID_WIN_SIZE 0x0048 */
#define MASK_WIN_WIDTH_OFFSET 0
#define MASK_WIN_WIDTH_BITS 10
#define MASK_WIN_WIDTH_MASK (((1 << 10) - 1) << 0)
#define MASK_WIN_HEIGHT_OFFSET 16
#define MASK_WIN_HEIGHT_BITS 10
#define MASK_WIN_HEIGHT_MASK (((1 << 10) - 1) << 16)
/* MASK_BITMAP0 0x0050 */
/* MASK_BITMAP1 0x0054 */
/* MASK_BITMAP58 0x0138 */
/* MASK_BITMAP59 0x013C */

#endif /* _ISP_REG_MASK_H_INC_ */

